#coding: utf-8
#Задача 1
x=int(input("Введите число x="))
y= 7*x+5
print("Ответ y=",y)

#Задача 2
x=int(input("Введите число x="))
y=4*x
print("Ответ y= ",y)

#Задача 3
x=int(input("Введите число x="))
y=2*3,14*x
print("Ответ y=",y)

#Задача 4 
x=int(input("Введите число x="))
S=3,14*x^2
print("Ответ S=",S)

#Задача 5
x=int(input("Введите число c="))
c=4^2+4^2
print("Ответ c=", c)

#Задача 6
x=int(input("Введите число P="))
P=2*3+2
print("Ответ P=",P)

